bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
      // Check if this is an edit (ID provided) or a new service
      String providedId = doc["id"] | "";
      bool isEdit = (providedId.length() > 0);
      int editIndex = -1;

      if (isEdit) {
        // Find the existing service to edit
        for (int i = 0; i < serviceCount; i++) {
          if (services[i].id == providedId) {
            editIndex = i;
            break;
          }
        }
        if (editIndex == -1) {
          request->send(404, "application/json", "{\"error\":\"Service not found for editing\"}");
          return;
        }
      } else {
        // Adding a new service - check if we have space
        if (serviceCount >= MAX_SERVICES) {
          request->send(400, "application/json", "{\"error\":\"Maximum services reached\"}");
          return;
        }
      }

      Service newService;
      
      // Set ID: use provided ID for edits, generate new ID for additions
      if (isEdit) {
        newService.id = providedId;
        // Preserve state from existing service
        newService.consecutivePasses = services[editIndex].consecutivePasses;
        newService.consecutiveFails = services[editIndex].consecutiveFails;
        newService.failedChecksSinceAlert = services[editIndex].failedChecksSinceAlert;
        newService.isUp = services[editIndex].isUp;
        newService.hasBeenUp = services[editIndex].hasBeenUp;
        newService.lastCheck = services[editIndex].lastCheck;
        newService.lastUptime = services[editIndex].lastUptime;
        newService.lastError = services[editIndex].lastError;
        newService.secondsSinceLastCheck = services[editIndex].secondsSinceLastCheck;
        newService.lastPush = services[editIndex].lastPush;
        newService.enabled = services[editIndex].enabled;
        newService.pauseUntil = services[editIndex].pauseUntil;
      } else {
        newService.id = generateServiceId();
        // Initialize state for new service
        newService.consecutivePasses = 0;
        newService.consecutiveFails = 0;
        newService.failedChecksSinceAlert = 0;
        newService.isUp = false;
        newService.hasBeenUp = false;
        newService.lastCheck = 0;
        newService.lastUptime = 0;
        newService.lastError = "";
        newService.secondsSinceLastCheck = -1;
        newService.lastPush = 0;
        newService.enabled = true;
        newService.pauseUntil = 0;
      }
      
      newService.name = doc["name"].as<String>();

      String typeStr = doc["type"].as<String>();
      if (typeStr == "http_get") {
        newService.type = TYPE_HTTP_GET;
      } else if (typeStr == "ping") {
        newService.type = TYPE_PING;
      } else if (typeStr == "snmp_get") {
        newService.type = TYPE_SNMP_GET;
      } else if (typeStr == "port") {
        newService.type = TYPE_PORT;
      } else if (typeStr == "push") {
        newService.type = TYPE_PUSH;
      } else {
        request->send(400, "application/json", "{\"error\":\"Invalid service type\"}");
        return;
      }

      newService.host = doc["host"].as<String>();
      newService.port = doc["port"] | 80;
      newService.path = doc["path"] | "/";
      newService.url = doc["url"].as<String>();
      newService.expectedResponse = doc["expectedResponse"] | "*";
      newService.checkInterval = doc["checkInterval"] | 60;

      int passThreshold = doc["passThreshold"] | 1;
      if (passThreshold < 1) passThreshold = 1;
      newService.passThreshold = passThreshold;

      int failThreshold = doc["failThreshold"] | 3;
      if (failThreshold < 1) failThreshold = 1;
      newService.failThreshold = failThreshold;

      int rearmCount = doc["rearmCount"] | 1440;
      if (rearmCount < 0) rearmCount = 0;
      newService.rearmCount = rearmCount;

      // SNMP-specific fields
      newService.snmpOid = doc["snmpOid"] | "";
      newService.snmpCommunity = doc["snmpCommunity"] | "public";
      String compareOpStr = doc["snmpCompareOp"] | "=";
      newService.snmpCompareOp = parseSnmpCompareOp(compareOpStr);
      newService.snmpExpectedValue = doc["snmpExpectedValue"] | "";

      // Push-specific fields
      if (newService.type == TYPE_PUSH) {
        // Use provided pushToken if available (for editing), otherwise generate new one
        String providedToken = doc["pushToken"] | "";
        if (providedToken.length() > 0) {
          newService.pushToken = providedToken;
        } else {
          newService.pushToken = generatePushToken();
        }
      } else {
        newService.pushToken = "";
      }

      // Store the service (either update existing or add new)
      if (isEdit) {
        services[editIndex] = newService;
        Serial.printf("Updated service: %s (ID: %s)\n", newService.name.c_str(), newService.id.c_str());
      } else {
        services[serviceCount++] = newService;
        // Initialize history and event log for new service
        initServiceHistory(newService.id);
        initServiceEventLog(newService.id);
        Serial.printf("Added new service: %s (ID: %s)\n", newService.name.c_str(), newService.id.c_str());
      }
      
      saveServices();

      JsonDocument response;
      response["success"] = true;
      response["id"] = newService.id;
      if (newService.type == TYPE_PUSH) {
        response["pushToken"] = newService.pushToken;
      }

      String responseStr;
      serializeJson(response, responseStr);
      request->send(200, "application/json", responseStr);
    }
  );

  // delete service
  server.on("/api/services/*", HTTP_DELETE, [](AsyncWebServerRequest *request) {
    if (!ensureAuthenticated(request)) {
      return;
    }
    String path = request->url();
    String serviceId = path.substring(path.lastIndexOf('/') + 1);

    int foundIndex = -1;
    for (int i = 0; i < serviceCount; i++) {
      if (services[i].id == serviceId) {
        foundIndex = i;
        break;
      }
    }

    if (foundIndex == -1) {
      request->send(404, "application/json", "{\"error\":\"Service not found\"}");
      return;
    }

    // Shift services array
    for (int i = foundIndex; i < serviceCount - 1; i++) {
      services[i] = services[i + 1];
    }
    serviceCount--;

    // Remove history for the deleted service
    removeServiceHistory(serviceId);
    
    // Remove event log for the deleted service
    removeServiceEventLog(serviceId);

    saveServices();
    request->send(200, "application/json", "{\"success\":true}");
  });

