bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // update service (enable/disable/pause)
  server.on("/api/services/*", HTTP_PATCH, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }

      // Extract service ID from URL path
      String path = request->url();
      String serviceId = path.substring(path.lastIndexOf('/') + 1);

      // Find the service
      int foundIndex = -1;
      if (xSemaphoreTake(servicesMutex, portMAX_DELAY)) {
        for (int i = 0; i < serviceCount; i++) {
          if (services[i].id == serviceId) {
            foundIndex = i;
            break;
          }
        }

        if (foundIndex == -1) {
          xSemaphoreGive(servicesMutex);
          request->send(404, "application/json", "{\"error\":\"Service not found\"}");
          return;
        }

        JsonDocument doc;
        if (deserializeJson(doc, data, len) != DeserializationError::Ok) {
          xSemaphoreGive(servicesMutex);
          request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
          return;
        }

        // Update enabled status if provided
        if (!doc["enabled"].isNull()) {
          services[foundIndex].enabled = doc["enabled"].as<bool>();
          Serial.printf("Service '%s' enabled set to %s\n", 
                        services[foundIndex].name.c_str(),
                        services[foundIndex].enabled ? "true" : "false");
        }

        // Update pause duration if provided (in seconds, 0 to unpause)
        if (!doc["pauseDuration"].isNull()) {
          int pauseDuration = doc["pauseDuration"].as<int>();
          if (pauseDuration > 0) {
            // Limit pause duration to prevent overflow (MAX_PAUSE_DURATION_SECONDS * 1000 fits in unsigned long)
            if (pauseDuration > MAX_PAUSE_DURATION_SECONDS) {
              pauseDuration = MAX_PAUSE_DURATION_SECONDS;
            }
            // Calculate pause end time - safe because pauseDuration is limited
            unsigned long durationMs = static_cast<unsigned long>(pauseDuration) * 1000UL;
            services[foundIndex].pauseUntil = millis() + durationMs;
            Serial.printf("Service '%s' paused for %d seconds\n", 
                          services[foundIndex].name.c_str(), pauseDuration);
          } else {
            services[foundIndex].pauseUntil = 0;
            Serial.printf("Service '%s' unpaused\n", services[foundIndex].name.c_str());
          }
        }

        saveServices();

        // Build response with current state (rollover-safe)
        unsigned long currentTimeMs = millis();
        JsonDocument response;
        response["success"] = true;
        response["id"] = services[foundIndex].id;
        response["enabled"] = services[foundIndex].enabled;
        response["pauseUntil"] = services[foundIndex].pauseUntil;
        response["pauseRemaining"] = getPauseRemainingMs(services[foundIndex].pauseUntil, currentTimeMs) / 1000;

        String responseStr;
        serializeJson(response, responseStr);
        request->send(200, "application/json", responseStr);
        
        xSemaphoreGive(servicesMutex);
      } else {
        request->send(500, "application/json", "{\"error\":\"Internal Server Error\"}");
        return;
      }
    }
  );

  // export services configuration
  server.on("/api/export", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray array = doc["services"].to<JsonArray>();

    if (xSemaphoreTake(servicesMutex, portMAX_DELAY)) {
      for (int i = 0; i < serviceCount; i++) {
        JsonObject obj = array.add<JsonObject>();
        obj["name"] = services[i].name;
        obj["type"] = getServiceTypeString(services[i].type);
        obj["host"] = services[i].host;
        obj["port"] = services[i].port;
        obj["path"] = services[i].path;
        obj["url"] = services[i].url;
        obj["expectedResponse"] = services[i].expectedResponse;
        obj["checkInterval"] = services[i].checkInterval;
        obj["passThreshold"] = services[i].passThreshold;
        obj["failThreshold"] = services[i].failThreshold;
        obj["rearmCount"] = services[i].rearmCount;
        // SNMP-specific fields
        obj["snmpOid"] = services[i].snmpOid;
        obj["snmpCommunity"] = services[i].snmpCommunity;
        obj["snmpCompareOp"] = getSnmpCompareOpString(services[i].snmpCompareOp);
        obj["snmpExpectedValue"] = services[i].snmpExpectedValue;
        // Push-specific fields (token is regenerated on import for security)
        // We don't export the token, just the type
      }
      xSemaphoreGive(servicesMutex);
    } else {
      request->send(500, "application/json", "{\"error\":\"Internal Server Error\"}");
      return;
    }

    String response;
    serializeJson(doc, response);

    AsyncWebServerResponse *res = request->beginResponse(200, "application/json", response);
    res->addHeader("Content-Disposition", "attachment; filename=\"monitors-backup.json\"");
    request->send(res);
  });

  // import services configuration
  server.on("/api/import", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }
      // Limit payload size to 16KB to prevent DoS
      if (total > 16384) {
        request->send(400, "application/json", "{\"error\":\"Payload too large\"}");
        return;
      }

      JsonDocument doc;
      DeserializationError error = deserializeJson(doc, data, len);

      if (error) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      JsonArray array = doc["services"];
      if (array.isNull()) {
        request->send(400, "application/json", "{\"error\":\"Missing services array\"}");
        return;
      }

      int importedCount = 0;
      int skippedCount = 0;

      if (xSemaphoreTake(servicesMutex, portMAX_DELAY)) {
        for (JsonObject obj : array) {
        if (serviceCount >= MAX_SERVICES) {
          skippedCount++;
          continue;
        }

        // Validate required fields
        String name = obj["name"].as<String>();
        String host = obj["host"].as<String>();
        String typeStr = obj["type"].as<String>();
        
        // Push type doesn't require host
        if (name.length() == 0) {
          skippedCount++;
          continue;
        }
        
        // Non-push types require host
        if (typeStr != "push" && host.length() == 0) {
          skippedCount++;
          continue;
        }

