bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
    if (needsCheck) {
#ifdef HAS_LCD
      anyServiceChecked = true;
#endif
      // Perform the actual check on the copy
      bool checkResult = false;
      switch (serviceCopy.type) {
        case TYPE_HTTP_GET:
          checkResult = checkHttpGet(serviceCopy);
          break;
        case TYPE_PING:
          checkResult = checkPing(serviceCopy);
          break;
        case TYPE_SNMP_GET:
          checkResult = checkSnmpGet(serviceCopy);
          break;
        case TYPE_PORT:
          checkResult = checkPort(serviceCopy);
          break;
        case TYPE_PUSH:
          checkResult = checkPush(serviceCopy);
          break;
      }

      // Update original service
      if (xSemaphoreTake(servicesMutex, portMAX_DELAY)) {
        // Find service by ID in case index shifted
        int idx = -1;
        for (int k = 0; k < serviceCount; k++) {
          if (services[k].id == serviceCopy.id) {
            idx = k;
            break;
          }
        }

        if (idx != -1) {
          // Record check result in history (needs mutex as it accesses serviceHistories)
          recordCheckResult(services[idx].id, checkResult);

          bool wasUp = services[idx].isUp;

          if (checkResult) {
            services[idx].consecutivePasses++;
            services[idx].consecutiveFails = 0;
            services[idx].lastUptime = currentTime;
            services[idx].lastError = "";
            services[idx].failedChecksSinceAlert = 0;  // Reset re-arm counter on success
          } else {
            services[idx].consecutiveFails++;
            services[idx].consecutivePasses = 0;
            services[idx].lastError = serviceCopy.lastError; // Copy error from check
          }

          // Determine new state based on thresholds
          if (!services[idx].isUp && services[idx].consecutivePasses >= services[idx].passThreshold) {
            // Service has passed enough times to be considered UP
            services[idx].isUp = true;
            services[idx].failedChecksSinceAlert = 0;  // Reset re-arm counter on recovery
          } else if (services[idx].isUp && services[idx].consecutiveFails >= services[idx].failThreshold) {
            // Service has failed enough times to be considered DOWN
            services[idx].isUp = false;
          }

          // Log and notify on state changes
          if (wasUp != services[idx].isUp) {
            Serial.printf("Service '%s' is now %s (after %d consecutive %s)\n",
              services[idx].name.c_str(),
              services[idx].isUp ? "UP" : "DOWN",
              services[idx].isUp ? services[idx].consecutivePasses : services[idx].consecutiveFails,
              services[idx].isUp ? "passes" : "fails");

            // Record the state change event
            String reason = services[idx].isUp ? 
              String(services[idx].consecutivePasses) + " consecutive passes" :
              String(services[idx].consecutiveFails) + " consecutive fails";
            recordServiceEvent(services[idx].id, services[idx].isUp, reason);

#ifdef HAS_LCD
            // Set display update flag BEFORE notifications to ensure display refreshes
            displayNeedsUpdate = true;
#endif

            if (!services[idx].isUp) {
              sendOfflineNotification(services[idx]);
              services[idx].failedChecksSinceAlert = 0;  // Reset counter after initial alert
            } else if (services[idx].hasBeenUp) {
              // Only send online notification if service was previously UP (not initial UP after boot)
              sendOnlineNotification(services[idx]);
            }
            
            // Mark that service has been UP at least once (for initial UP notification suppression)
            if (services[idx].isUp) {
              services[idx].hasBeenUp = true;
            }
          } else if (!services[idx].isUp && !checkResult && services[idx].rearmCount > 0) {
            // Service is still DOWN and check failed - handle re-arm logic
            services[idx].failedChecksSinceAlert++;
            if (services[idx].failedChecksSinceAlert >= services[idx].rearmCount) {
              Serial.printf("Service '%s' still DOWN - re-arming alert after %d failed checks\n",
                services[idx].name.c_str(), services[idx].failedChecksSinceAlert);
              sendOfflineNotification(services[idx]);
              services[idx].failedChecksSinceAlert = 0;  // Reset counter after re-arm alert
            }
          }

#ifdef HAS_LCD
          // Update display if viewing detail view and this specific service was checked
          if (currentView == VIEW_DETAIL && idx == currentServiceIndex) {
            displayNeedsUpdate = true;
          }
#endif
        }
        xSemaphoreGive(servicesMutex);
      }
    }
    i++;
  }

#ifdef HAS_LCD
  // Update display if in main view and any service was checked
  // This is done once outside the loop to avoid redundant flag setting
  if (currentView == VIEW_MAIN && anyServiceChecked) {
    displayNeedsUpdate = true;
  }
#endif
}

// Helper function to match text against a POSIX extended regex pattern
// Returns 0 on match, 1 on no match, -1 on pattern too long, -2 on invalid pattern
int matchesRegex(const String& text, const String& pattern) {
  // Limit pattern length to prevent excessive resource usage
  if (pattern.length() > MAX_REGEX_PATTERN_LENGTH) {
    return -1;
  }
  
  regex_t regex;
  int result;
  
  // Compile the regex pattern with extended syntax
  result = regcomp(&regex, pattern.c_str(), REG_EXTENDED | REG_NOSUB);
  if (result != 0) {
    // Pattern compilation failed - do not call regfree() on failed compile
    return -2;
  }
  
  // Execute the regex match
  result = regexec(&regex, text.c_str(), 0, NULL, 0);
  regfree(&regex);
  
  return result == 0 ? 0 : 1;  // 0 = match, 1 = no match
}

bool checkHttpGet(Service& service) {
  HTTPClient http;
  
  // Use the URL field directly - supports both HTTP and HTTPS
  String url = service.url;
  
