bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Also add integer handler for numeric values
  ValueCallback* intCallback = snmpManager.addIntegerHandler(targetIP, oidStr.c_str(), &intValue);
  
  // Build and send SNMP request - add both callbacks
  snmpRequest.addOIDPointer(stringCallback);
  snmpRequest.addOIDPointer(intCallback);
  snmpRequest.setIP(WiFi.localIP());
  snmpRequest.setUDP(&udp);
  snmpRequest.setRequestID(random(1, 65535));
  
  if (!snmpRequest.sendTo(targetIP)) {
    service.lastError = "Failed to send SNMP request";
    return false;
  }
  snmpRequest.clearOIDList();
  
  // Wait for response with timeout (5 seconds)
  unsigned long startTime = millis();
  const unsigned long timeout = 5000;
  
  while (millis() - startTime < timeout) {
    snmpManager.loop();
    
    // Check if we got a string response (non-empty string)
    if (stringValue[0] != '\0') {
      responseValue = String(stringValue);
      gotResponse = true;
      break;
    }
    
    // Check if we got an integer response (value changed from sentinel)
    if (intValue != INT32_MIN) {
      responseValue = String(intValue);
      gotResponse = true;
      break;
    }
    
    // Yield to prevent watchdog timeout
    vTaskDelay(pdMS_TO_TICKS(10));
  }
  
  if (!gotResponse) {
    service.lastError = "SNMP timeout";
    return false;
  }
  
  // Compare the received value with expected value
  bool success = compareSnmpValue(responseValue, service.snmpCompareOp, service.snmpExpectedValue);
  
  if (!success) {
    service.lastError = "Value mismatch: got '" + responseValue + "', expected " + 
                        getSnmpCompareOpString(service.snmpCompareOp) + " '" + 
                        service.snmpExpectedValue + "'";
  }
  
  return success;
}

String getSnmpCompareOpString(SnmpCompareOp op) {
  switch (op) {
    case SNMP_OP_EQ: return "=";
    case SNMP_OP_NE: return "<>";
    case SNMP_OP_LT: return "<";
    case SNMP_OP_LE: return "<=";
    case SNMP_OP_GT: return ">";
    case SNMP_OP_GE: return ">=";
    default: return "=";
  }
}

SnmpCompareOp parseSnmpCompareOp(const String& opStr) {
  if (opStr == "=" || opStr == "eq") return SNMP_OP_EQ;
  if (opStr == "<>" || opStr == "ne") return SNMP_OP_NE;
  if (opStr == "<" || opStr == "lt") return SNMP_OP_LT;
  if (opStr == "<=" || opStr == "le") return SNMP_OP_LE;
  if (opStr == ">" || opStr == "gt") return SNMP_OP_GT;
  if (opStr == ">=" || opStr == "ge") return SNMP_OP_GE;
  return SNMP_OP_EQ;  // Default to equal
}

void sendOfflineNotification(const Service& service) {
  if (!isNtfyConfigured() && !isDiscordConfigured() && !isSmtpConfigured() && !isMeshCoreConfigured()) {
    return;
  }

  bool wifiConnected = WiFi.status() == WL_CONNECTED;

  String title = "Service DOWN: " + service.name;
  String message = "Service '" + service.name + "' at " + service.host;
  if (service.port > 0 && service.type != TYPE_PING) {
    message += ":" + String(service.port);
  }
  message += " is offline.";

  if (service.lastError.length() > 0) {
    message += " Error: " + service.lastError;
  }

  String tags = "warning,monitor";
  bool ntfyFailed = false;
  bool discordFailed = false;
  bool smtpFailed = false;
  bool meshFailed = false;

  if (wifiConnected) {
    if (isNtfyConfigured()) {
      if (!sendNtfyNotificationWithStatus(title, message, tags)) {
        ntfyFailed = true;
      }
    }

    if (isDiscordConfigured()) {
      if (!sendDiscordNotificationWithStatus(title, message)) {
        discordFailed = true;
      }
    }

    if (isSmtpConfigured()) {
      if (!sendSmtpNotificationWithStatus(title, message)) {
        smtpFailed = true;
      }
    }
  } else {
    Serial.println("WiFi offline: queueing internet notifications");
    ntfyFailed = isNtfyConfigured();
    discordFailed = isDiscordConfigured();
    smtpFailed = isSmtpConfigured();
  }

  if (isMeshCoreConfigured()) {
    if (!sendMeshCoreNotificationWithStatus(title, message)) {
      meshFailed = true;
    }
  }

  // Queue any failed notifications for retry
  queueNotification(service.id, title, message, false, tags, 
                    ntfyFailed, discordFailed, smtpFailed, meshFailed);
}

void sendOnlineNotification(const Service& service) {
  if (!isNtfyConfigured() && !isDiscordConfigured() && !isSmtpConfigured() && !isMeshCoreConfigured()) {
    return;
  }

  bool wifiConnected = WiFi.status() == WL_CONNECTED;

  String title = "Service UP: " + service.name;
  String message = "Service '" + service.name + "' at " + service.host;
  if (service.port > 0 && service.type != TYPE_PING) {
    message += ":" + String(service.port);
  }
  message += " is back online.";

  String tags = "ok,monitor";
  bool ntfyFailed = false;
  bool discordFailed = false;
  bool smtpFailed = false;
  bool meshFailed = false;

  if (wifiConnected) {
    if (isNtfyConfigured()) {
      if (!sendNtfyNotificationWithStatus(title, message, tags)) {
        ntfyFailed = true;
      }
    }

    if (isDiscordConfigured()) {
      if (!sendDiscordNotificationWithStatus(title, message)) {
        discordFailed = true;
      }
    }

    if (isSmtpConfigured()) {
      if (!sendSmtpNotificationWithStatus(title, message)) {
        smtpFailed = true;
      }
    }
  } else {
    Serial.println("WiFi offline: queueing internet notifications");
    ntfyFailed = isNtfyConfigured();
    discordFailed = isDiscordConfigured();
    smtpFailed = isSmtpConfigured();
  }

  if (isMeshCoreConfigured()) {
    if (!sendMeshCoreNotificationWithStatus(title, message)) {
      meshFailed = true;
    }
  }

  // Queue any failed notifications for retry
  queueNotification(service.id, title, message, true, tags, 
                    ntfyFailed, discordFailed, smtpFailed, meshFailed);
}

void sendNtfyNotification(const String& title, const String& message, const String& tags) {
  HTTPClient http;
  String url = String(NTFY_SERVER) + "/" + NTFY_TOPIC;

  WiFiClientSecure client;
  bool isSecure = url.startsWith("https://");
  if (isSecure) {
    client.setInsecure();
    http.begin(client, url);
  } else {
    http.begin(url);
  }
  http.addHeader("Title", title);
  http.addHeader("Tags", tags);
  http.addHeader("Content-Type", "text/plain");

  if (strlen(NTFY_ACCESS_TOKEN) > 0) {
    http.addHeader("Authorization", "Bearer " + String(NTFY_ACCESS_TOKEN));
  } else if (strlen(NTFY_USERNAME) > 0) {
    http.setAuthorization(NTFY_USERNAME, NTFY_PASSWORD);
  }

  int httpCode = http.POST(message);

  if (httpCode > 0) {
    Serial.printf("ntfy notification sent: %d\n", httpCode);
  } else {
    Serial.printf("Failed to send ntfy notification: %d\n", httpCode);
  }

  http.end();
}

void sendDiscordNotification(const String& title, const String& message) {
  HTTPClient http;
  String url = String(DISCORD_WEBHOOK_URL);

  WiFiClientSecure client;
  bool isSecure = url.startsWith("https://");
  if (isSecure) {
    client.setInsecure();
    http.begin(client, url);
  } else {
    http.begin(url);
  }

  http.addHeader("Content-Type", "application/json");

  JsonDocument doc;
  doc["content"] = "**" + title + "**\n" + message;

  String payload;
  serializeJson(doc, payload);

