bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
    eventLogCount++;
  }
  
  Serial.printf("Loaded event logs for %d services\n", eventLogCount);
}

String getServiceTypeString(ServiceType type) {
  switch (type) {
    case TYPE_HTTP_GET: return "http_get";
    case TYPE_PING: return "ping";
    case TYPE_SNMP_GET: return "snmp_get";
    case TYPE_PORT: return "port";
    case TYPE_PUSH: return "push";
    default: return "unknown";
  }
}

// --- LCD and Touch Screen Functions (Conditional) ---
#ifdef HAS_LCD

// Record user activity for screen timeout
void recordActivity() {
  lastActivityTime = millis();
}

// Turn screen off (backlight off)
void turnScreenOff() {
  if (!displayReady) return;
  // Cannot turn off backlight (GPIO 38) because it resets touch.
  // Cannot use PWM (dimming) because it resets touch.
  // Solution: Keep backlight ON (HIGH) and draw black screen to simulate off.
  if (TFT_BL_PIN >= 0) {
    digitalWrite(TFT_BL_PIN, HIGH);
  }
  display.fillScreen(TFT_BLACK);
  currentView = VIEW_OFF;
  Serial.println("Screen 'turned off' (Black screen, BL On)");
}

// Turn screen on (restore backlight)
void turnScreenOn() {
  if (!displayReady) return;
  // Ensure backlight is ON (HIGH)
  if (TFT_BL_PIN >= 0) {
    digitalWrite(TFT_BL_PIN, HIGH);
  }
  currentView = VIEW_MAIN;
  recordActivity();
  displayNeedsUpdate = true;
  Serial.println("Screen turned on");
}

void initDisplay() {
  Serial.println("Initializing display...");
  
  // Reset the GT911 touch controller with proper I2C address selection.
  // The GT911 I2C address is determined by the state of the INT pin during the
  // rising edge of RST:
  //   - INT HIGH during RST rise -> address 0x14
  //   - INT LOW during RST rise -> address 0x5D
  // Hardware note: On ESP32-4848S040, GPIO 38 is shared between touch reset and backlight.
  // After reset, LovyanGFX reconfigures this pin for PWM backlight control.
  if (TOUCH_RST_PIN >= 0) {
    // Configure INT pin as output and set HIGH to select address 0x14
    if (TOUCH_INT_PIN >= 0) {
      pinMode(TOUCH_INT_PIN, OUTPUT);
      digitalWrite(TOUCH_INT_PIN, HIGH);
      delay(5);  // Ensure INT state is stable before reset sequence
    }

    // Perform reset sequence - timing is critical for GT911 address selection
    pinMode(TOUCH_RST_PIN, OUTPUT);
    digitalWrite(TOUCH_RST_PIN, LOW);
    delay(20);  // GT911 requires minimum 10ms reset pulse, use 20ms for margin
    digitalWrite(TOUCH_RST_PIN, HIGH);
    delay(100);  // Wait for GT911 address latch and internal initialization

    // Release INT pin for normal interrupt operation
    if (TOUCH_INT_PIN >= 0) {
      pinMode(TOUCH_INT_PIN, INPUT);
    }

    // Additional delay to allow GT911 I2C to stabilize after INT released
    delay(50);

    Serial.println("GT911 touch controller reset complete");
  } else {
    Serial.println("GT911 reset pin not managed (TOUCH_RST_PIN < 0); skipping manual reset");
  }

  // Debug: Scan I2C bus to verify GT911 presence and address
  Serial.printf("Scanning I2C bus (SDA=%d, SCL=%d)...\n", TOUCH_SDA_PIN, TOUCH_SCL_PIN);

  // Initialize Wire with explicit pins
  if (!Wire.begin(TOUCH_SDA_PIN, TOUCH_SCL_PIN)) {
    Serial.println("Failed to initialize I2C bus!");
  } else {
    int devicesFound = 0;
    uint8_t foundAddr = 0;
    for (byte address = 1; address < 127; address++) {
      Wire.beginTransmission(address);
      byte error = Wire.endTransmission();
      if (error == 0) {
        Serial.printf("I2C device found at address 0x%02X\n", address);
        devicesFound++;
        if (address == 0x14 || address == 0x5D) {
          foundAddr = address;
        }
      }
    }
    if (devicesFound == 0) Serial.println("No I2C devices found");

    if (foundAddr == 0x14) {
      Serial.println("GT911 detected at 0x14 (INT held high during boot)");
    } else if (foundAddr == 0x5D) {
      Serial.println("GT911 detected at 0x5D (default address)");
    }

    // Important: End Wire so LGFX can initialize its own I2C driver
    Wire.end();
    delay(50);  // Ensure bus is free
  }
  
  displayReady = display.init();
  display.setRotation(0);  // Rotation 0 for ESP32-4848S040 square display
  display.setTextSize(2);
  display.setTextColor(TFT_WHITE, TFT_BLACK);

  if (TFT_BL_PIN >= 0) {
    // Manually enable backlight (GPIO 38 HIGH)
    // This also takes the Touch Controller out of Reset
    pinMode(TFT_BL_PIN, OUTPUT);
    digitalWrite(TFT_BL_PIN, HIGH);
    // Give GT911 time to boot after taking it out of reset
    delay(200);
  }

  // Verify touch controller is working by checking if touch object exists and
  // attempting a test read. The touch object existing just means it was configured,
  // not that it successfully initialized and can communicate with the hardware.
  touchReady = false;
  lgfx::ITouch* touchController = display.touch();
  if (touchController != nullptr) {
    // Get the touch configuration for debug logging
    auto touchCfg = touchController->config();
    Serial.printf("Touch controller configured: I2C addr=0x%02X, INT pin=%d\n", 
                  touchCfg.i2c_addr, touchCfg.pin_int);
    
    // Attempt multiple test touch reads to verify I2C communication is working.
    // The GT911 may need a few polls to fully wake up and respond reliably.
    lgfx::touch_point_t tp;
    
    for (int attempt = 0; attempt < 5; attempt++) {
      // getTouch returns the number of touch points detected (0 or more)
      // Even if no touch is active, a successful read returns 0 (not -1 or error)
      // The important thing is that the call doesn't crash and the internal
      // state machine progresses
      display.getTouch(&tp, 1);
      delay(20);
    }
    
    // After triggering the initialization through reads, we consider it ready
    // if the touch object is still valid. The GT911 driver in LovyanGFX will
    // try both I2C addresses and set _inited if successful.
    touchReady = true;
    Serial.println("Touch controller (GT911) initialized successfully");
  } else {
    Serial.println("Touch controller not configured or not detected");
  }

  if (displayReady) {
    // Initialize screen timeout from config (SCREEN_TIMEOUT in seconds, 0 = disabled)
    // Validate: must be 0 (disabled) or between 10-600 seconds
    if (SCREEN_TIMEOUT == 0) {
      screenTimeoutMs = 0;  // Disabled
      Serial.println("Screen timeout disabled via config");
    } else if (SCREEN_TIMEOUT >= 10 && SCREEN_TIMEOUT <= 600) {
      screenTimeoutMs = (unsigned long)SCREEN_TIMEOUT * 1000;
      Serial.printf("Screen timeout set from config: %d seconds\n", SCREEN_TIMEOUT);
    } else {
      // Invalid value, use default 60 seconds
      screenTimeoutMs = 60000;
      Serial.printf("Invalid SCREEN_TIMEOUT value (%d), using default 60 seconds\n", SCREEN_TIMEOUT);
    }
    
    display.startWrite();
    display.fillScreen(TFT_BLACK);
    display.endWrite();
    currentView = VIEW_MAIN;
    recordActivity();
    displayNeedsUpdate = true;
    Serial.println("Display initialized successfully");
  } else {
    Serial.println("Display initialization failed");
  }
}

// Draw the header with title and power button
void drawHeader() {
  int16_t width = display.width();
  
