bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // SNMP-specific info
  if (svc.type == TYPE_SNMP_GET && svc.snmpOid.length() > 0) {
    display.setCursor(10, contentY);
    display.setTextSize(1);
    display.printf("OID: %s", svc.snmpOid.c_str());
    contentY += 15;
    display.setTextSize(2);
  }
  
  contentY += 10;
  
  // Timing information
  display.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
  display.setCursor(10, contentY);
  display.printf("Interval: %ds", svc.checkInterval);
  contentY += 25;
  
  display.setCursor(10, contentY);
  if (svc.lastCheck == 0) {
    display.print("Last check: pending");
  } else {
    unsigned long sinceCheck = (millis() - svc.lastCheck) / 1000;
    display.printf("Last check: %lus ago", sinceCheck);
  }
  contentY += 25;
  
  // Thresholds
  display.setCursor(10, contentY);
  display.printf("Thresholds: %d fail / %d pass", svc.failThreshold, svc.passThreshold);
  contentY += 25;
  
  // Consecutive counts
  display.setCursor(10, contentY);
  display.printf("Consecutive: %d pass / %d fail", svc.consecutivePasses, svc.consecutiveFails);
  contentY += 25;
  
  // Pause status
  if (svc.pauseUntil > 0) {
    unsigned long remaining = getPauseRemainingMs(svc.pauseUntil, millis());
    if (remaining > 0) {
      display.setTextColor(TFT_ORANGE, TFT_BLACK);
      display.setCursor(10, contentY);
      display.printf("Paused: %lus remaining", remaining / 1000);
      contentY += 25;
    }
  }
  
  // Error message if present
  if (svc.lastError.length() > 0) {
    display.setTextColor(TFT_RED, TFT_BLACK);
    display.setCursor(10, contentY);
    display.print("Error:");
    contentY += 20;
    display.setTextSize(1);
    String errorDisplay = svc.lastError;
    if (errorDisplay.length() > 50) {
      errorDisplay = errorDisplay.substring(0, 47) + "...";
    }
    display.setCursor(10, contentY);
    display.print(errorDisplay);
  }
  display.endWrite();
}

// Handle touch input for main view
void handleMainViewTouch(int16_t x, int16_t y) {
  int16_t width = display.width();
  int16_t height = display.height();
  
  // Check power button (top right) - simple tap to turn off screen
  int powerBtnX = width - POWER_BUTTON_SIZE - 5;
  int powerBtnY = 5;
  if (x >= powerBtnX && x <= powerBtnX + POWER_BUTTON_SIZE &&
      y >= powerBtnY && y <= powerBtnY + POWER_BUTTON_SIZE) {
    turnScreenOff();
    return;
  }
  
  // Check service buttons
  if (serviceCount > 0 && y > HEADER_HEIGHT) {
    int cols = 2;
    int buttonWidth = (width - (cols + 1) * SERVICE_BUTTON_MARGIN) / cols;
    int startY = HEADER_HEIGHT + SERVICE_BUTTON_MARGIN;
    int availableHeight = height - startY - SERVICE_BUTTON_MARGIN;
    int maxRows = availableHeight / (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
    
    for (int i = 0; i < serviceCount && i < maxRows * cols; i++) {
      int row = i / cols;
      int col = i % cols;
      
      int btnX = SERVICE_BUTTON_MARGIN + col * (buttonWidth + SERVICE_BUTTON_MARGIN);
      int btnY = startY + row * (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
      
      if (x >= btnX && x <= btnX + buttonWidth &&
          y >= btnY && y <= btnY + SERVICE_BUTTON_HEIGHT) {
        // Service button tapped - show detail view
        currentServiceIndex = i;
        currentView = VIEW_DETAIL;
        displayNeedsUpdate = true;
        return;
      }
    }
  }
}

// Handle touch input for detail view
void handleDetailViewTouch(int16_t x, int16_t y) {
  // Check back button (top left)
  if (x >= 5 && x <= 65 && y >= 5 && y <= 5 + POWER_BUTTON_SIZE) {
    currentView = VIEW_MAIN;
    displayNeedsUpdate = true;
    return;
  }
}

// Handle touch input when screen is off (double-tap to wake)
void handleScreenOffTouch(int16_t x, int16_t y) {
  unsigned long now = millis();
  
  // Check for double-tap
  if (now - lastTapTime <= DOUBLE_TAP_WINDOW_MS) {
    // Double-tap detected - wake up screen
    turnScreenOn();
    lastTapTime = 0;  // Reset to prevent accidental triple-tap
  } else {
    lastTapTime = now;
  }
}

void handleDisplayLoop() {
  if (!displayReady) return;

  unsigned long now = millis();

  // Handle touch input
  if (touchReady && (now - lastTouchTime >= TOUCH_DEBOUNCE_MS)) {
    lgfx::touch_point_t tp;
    int touchCount = display.getTouch(&tp, 1);
    
    if (touchCount > 0) {
      int16_t x = tp.x;
      int16_t y = tp.y;
      lastTouchTime = now;
      
      if (currentView == VIEW_OFF) {
        // Screen is off - check for double-tap to wake
        handleScreenOffTouch(x, y);
      } else {
        // Screen is on - record activity and handle touch
        recordActivity();
        
        switch (currentView) {
          case VIEW_MAIN:
            handleMainViewTouch(x, y);
            break;
          case VIEW_DETAIL:
            handleDetailViewTouch(x, y);
            break;
          default:
            break;
        }
      }
    }
  }
  
  // Handle screen timeout (only when screen is on and timeout is enabled)
  if (currentView != VIEW_OFF && screenTimeoutMs > 0) {
    if (now - lastActivityTime >= screenTimeoutMs) {
      turnScreenOff();
    }
  }

  // Update display if needed
  if (displayNeedsUpdate && currentView != VIEW_OFF) {
    switch (currentView) {
      case VIEW_MAIN:
        renderMainView();
        break;
      case VIEW_DETAIL:
        renderDetailView();
        break;
      default:
        break;
    }
    displayNeedsUpdate = false;
  }
  
  // Periodically refresh display to update status changes
  // Auto-refresh applies to both main view (all services) and detail view (single service)
  static unsigned long lastAutoRefresh = 0;
  if ((currentView == VIEW_MAIN || currentView == VIEW_DETAIL) && 
      now - lastAutoRefresh >= DISPLAY_AUTO_REFRESH_MS) {
    displayNeedsUpdate = true;
    lastAutoRefresh = now;
  }
}

#endif // HAS_LCD

String getWebPage() {
  return R"rawliteral(<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ESP32 Uptime Monitor - Status</title>
    <style>
        * { margin: 0; padding: 0; box-sizing: border-box; }
        body {
            font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, sans-serif;
            background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
            min-height: 100vh;
            padding: 20px;
        }
        .container { max-width: 1200px; margin: 0 auto; }
        .header { text-align: center; color: white; margin-bottom: 30px; }
        .header h1 { font-size: 2.5em; margin-bottom: 10px; text-shadow: 2px 2px 4px rgba(0,0,0,0.2); }
        .header p { font-size: 1.1em; opacity: 0.9; }
        .admin-link { text-align: center; margin-bottom: 20px; }
        .admin-link a {
            display: inline-block; padding: 12px 24px; background: white; color: #667eea;
            text-decoration: none; border-radius: 6px; font-weight: 600; transition: all 0.3s;
            box-shadow: 0 4px 6px rgba(0,0,0,0.1);
        }
        .admin-link a:hover { transform: translateY(-2px); box-shadow: 0 6px 12px rgba(0,0,0,0.15); }
        .status-table {
            background: white; border-radius: 12px; padding: 25px;
            box-shadow: 0 4px 6px rgba(0,0,0,0.1); overflow-x: auto;
        }
        table { width: 100%; border-collapse: collapse; }
        th {
            background: #f9fafb; padding: 15px; text-align: left; font-weight: 600;
            color: #374151; border-bottom: 2px solid #e5e7eb;
        }
        td { padding: 15px; border-bottom: 1px solid #e5e7eb; color: #6b7280; }
        tr:last-child td { border-bottom: none; }
        tr:hover { background: #f9fafb; }
        .service-name { font-weight: 600; color: #1f2937; }
        .status-badge {
            display: inline-block; padding: 4px 12px; border-radius: 20px;
            font-size: 0.85em; font-weight: 600;
        }
        .status-badge.up { background: #d1fae5; color: #065f46; }
        .status-badge.down { background: #fee2e2; color: #991b1b; }
        .status-badge.pending { background: #e0e7ff; color: #3730a3; }
        .status-badge.paused { background: #fef3c7; color: #92400e; }
        .empty-state { text-align: center; padding: 60px 20px; color: white; }
        .empty-state h3 { font-size: 1.5em; margin-bottom: 10px; }
        .hidden { display: none; }
        .history-container { display: flex; align-items: center; gap: 8px; }
        .history-graph { display: flex; gap: 2px; align-items: center; }
        .history-bar {
            width: 4px; height: 20px; border-radius: 2px;
            background: #e5e7eb; transition: background 0.3s;
        }
        .history-bar.up-100 { background: #10b981; }
        .history-bar.up-75 { background: #34d399; }
        .history-bar.up-50 { background: #fbbf24; }
        .history-bar.up-25 { background: #f87171; }
        .history-bar.up-0 { background: #ef4444; }
        .uptime-percentage {
            font-size: 0.85em; font-weight: 600; color: #10b981;
            min-width: 45px; text-align: right;
        }
        .history-container { cursor: pointer; }
        .history-container:hover .history-graph { opacity: 0.8; }
        
