bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
        /* Modal styles */
        .modal {
            display: none;
            position: fixed;
            z-index: 1000;
            left: 0;
            top: 0;
            width: 100%;
            height: 100%;
            background-color: rgba(0, 0, 0, 0.5);
            animation: fadeIn 0.3s;
        }
        .modal.show { display: flex; align-items: center; justify-content: center; }
        .modal-content {
            background: white;
            border-radius: 12px;
            padding: 30px;
            max-width: 600px;
            width: 90%;
            max-height: 80vh;
            overflow-y: auto;
            box-shadow: 0 10px 25px rgba(0,0,0,0.2);
            animation: slideUp 0.3s;
        }
        .modal-header {
            display: flex;
            justify-content: space-between;
            align-items: center;
            margin-bottom: 20px;
            padding-bottom: 15px;
            border-bottom: 2px solid #e5e7eb;
        }
        .modal-header h2 {
            color: #1f2937;
            font-size: 1.5em;
            margin: 0;
        }
        .close-btn {
            background: none;
            border: none;
            font-size: 1.5em;
            color: #6b7280;
            cursor: pointer;
            padding: 0;
            width: 30px;
            height: 30px;
            display: flex;
            align-items: center;
            justify-content: center;
            border-radius: 4px;
            transition: all 0.2s;
        }
        .close-btn:hover {
            background: #f3f4f6;
            color: #1f2937;
        }
        .event-list {
            margin-top: 15px;
        }
        .event-item {
            padding: 15px;
            margin-bottom: 10px;
            border-left: 4px solid;
            background: #f9fafb;
            border-radius: 4px;
        }
        .event-item.up {
            border-left-color: #10b981;
            background: #d1fae5;
        }
        .event-item.down {
            border-left-color: #ef4444;
            background: #fee2e2;
        }
        .event-time {
            font-size: 0.9em;
            color: #6b7280;
            margin-bottom: 5px;
        }
        .event-status {
            font-weight: 600;
            font-size: 1.1em;
            margin-bottom: 5px;
        }
        .event-item.up .event-status { color: #065f46; }
        .event-item.down .event-status { color: #991b1b; }
        .event-reason {
            font-size: 0.9em;
            color: #4b5563;
        }
        .no-events {
            text-align: center;
            padding: 40px 20px;
            color: #6b7280;
        }
        @keyframes fadeIn {
            from { opacity: 0; }
            to { opacity: 1; }
        }
        @keyframes slideUp {
            from { transform: translateY(20px); opacity: 0; }
            to { transform: translateY(0); opacity: 1; }
        }
        @media (max-width: 768px) {
            .header h1 { font-size: 1.8em; }
            .status-table { padding: 15px; }
            th, td { padding: 10px 8px; font-size: 0.9em; }
            .history-bar { width: 3px; height: 16px; }
            .modal-content { padding: 20px; }
            .modal-header h2 { font-size: 1.2em; }
        }
    </style>
</head>
<body>
    <div class="container">
        <div class="header">
            <h1>ESP32 Uptime Monitor</h1>
            <p>Service Status Overview</p>
        </div>
        <div class="admin-link">
            <a href="/admin">Administration Panel</a>
        </div>
        <div class="status-table" id="statusTable">
            <table>
                <thead>
                    <tr>
                        <th>Service</th>
                        <th>Type</th>
                        <th>Status</th>
                        <th>Uptime (30d)</th>
                        <th>Last Checked</th>
                    </tr>
                </thead>
                <tbody id="servicesTableBody">
                </tbody>
            </table>
        </div>
        <div id="emptyState" class="empty-state hidden">
            <h3>No services configured</h3>
            <p>Visit the <a href="/admin" style="color: white; text-decoration: underline;">administration panel</a> to add services</p>
        </div>
    </div>
    
    <!-- Event Log Modal -->
    <div id="eventModal" class="modal">
        <div class="modal-content">
            <div class="modal-header">
                <h2 id="modalServiceName">Event Log</h2>
                <button class="close-btn" onclick="closeEventModal()">&times;</button>
            </div>
            <div id="eventList" class="event-list">
                <!-- Events will be populated here -->
            </div>
        </div>
    </div>
    
    <script>
        let services = [];
        let serviceHistories = {};
        
        async function loadServices() {
            try {
                const response = await fetch('/api/services');
                const data = await response.json();
                services = data.services || [];
                // Sort services alphabetically by name
                services.sort((a, b) => a.name.localeCompare(b.name));
                
                // Load history for all services
                await loadHistories();
                
                renderServices();
            } catch (error) {
                console.error('Error loading services:', error);
            }
        }
        
        async function loadHistories() {
            // Load history for each service
            const historyPromises = services.map(async service => {
                try {
                    const response = await fetch(`/api/history/${service.id}`);
                    if (response.ok) {
                        const data = await response.json();
                        serviceHistories[service.id] = data;
                    }
                } catch (error) {
                    console.error(`Error loading history for ${service.name}:`, error);
                }
            });
            await Promise.all(historyPromises);
        }
        
        function renderHistoryGraph(serviceId) {
            const history = serviceHistories[serviceId];
            if (!history || !history.hourlyUptime || history.hourlyUptime.length === 0) {
                return '<div class="history-container"><span class="uptime-percentage">N/A</span></div>';
            }
            
            // Display last 90 hours (about 4 days) for readability
            // Full 30 days of data is stored but truncated for display
            const DISPLAY_HOURS = 90;
            const recentHistory = history.hourlyUptime.slice(-DISPLAY_HOURS);
            const uptimePercent = history.uptimePercentage.toFixed(1);
            
