bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
            // Preserve pushToken when editing a PUSH service
            if (editingPushToken && data.type === 'push') {
                data.pushToken = editingPushToken;
            }

            try {
                const response = await fetch('/api/services', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify(data)
                });

                if (response.ok) {
                    showAlert('Service added successfully!', 'success');
                    this.reset();
                    editingServiceId = null;  // Clear the stored service ID
                    editingPushToken = null;  // Clear the stored pushToken
                    document.getElementById('serviceType').dispatchEvent(new Event('change'));
                    loadServices();
                } else {
                    showAlert('Failed to add service', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        });

        // Load services
        async function loadServices() {
            try {
                const response = await fetch('/api/services');
                const data = await response.json();
                services = data.services || [];
                renderServices();
            } catch (error) {
                console.error('Error loading services:', error);
            }
        }

        // Render services
        function renderServices() {
            const tbody = document.getElementById('servicesTableBody');
            const emptyState = document.getElementById('emptyState');

            if (services.length === 0) {
                tbody.innerHTML = '<tr><td colspan="6" style="text-align: center; padding: 40px; color: #9ca3af;">No services configured yet. Add your first service using the form above.</td></tr>';
                return;
            }

            emptyState.classList.add('hidden');

            tbody.innerHTML = services.map(service => {
                let uptimeStr = 'Not checked yet';

                if (service.secondsSinceLastCheck >= 0) {
                    const seconds = service.secondsSinceLastCheck;
                    if (seconds < 60) {
                        uptimeStr = `${seconds}s ago`;
                    } else if (seconds < 3600) {
                        const minutes = Math.floor(seconds / 60);
                        const secs = seconds % 60;
                        uptimeStr = `${minutes}m ${secs}s ago`;
                    } else {
                        const hours = Math.floor(seconds / 3600);
                        const minutes = Math.floor((seconds % 3600) / 60);
                        uptimeStr = `${hours}h ${minutes}m ago`;
                    }
                }

                // Determine status
                const isPending = service.secondsSinceLastCheck < 0;
                let statusText = service.isUp ? 'UP' : 'DOWN';
                let statusClass = service.isUp ? 'up' : 'down';
                
                if (isPending) {
                    statusText = 'PENDING';
                    statusClass = 'pending';
                } else if (!service.enabled) {
                    statusText = 'DISABLED';
                    statusClass = 'paused';
                } else if (service.pauseRemaining > 0) {
                    const pauseMins = Math.floor(service.pauseRemaining / 60);
                    const pauseSecs = service.pauseRemaining % 60;
                    const pauseStr = pauseMins > 0 ? `${pauseMins}m ${pauseSecs}s` : `${pauseSecs}s`;
                    statusText = `PAUSED (${pauseStr})`;
                    statusClass = 'paused';
                }

                // Build target info based on service type
                let target = '';
                if (service.type === 'http_get' && service.url) {
                    target = service.url;
                } else if (service.type === 'push') {
                    target = 'Push endpoint';
                } else if (service.type === 'ping') {
                    target = service.host;
                } else if (service.host) {
                    target = `${service.host}:${service.port}`;
                }

                // Build action buttons
                const editBtn = `<button class="btn-small btn-edit" onclick="editService('${service.id}')">Edit</button>`;
                const pauseBtn = service.pauseRemaining > 0
                    ? `<button class="btn-small btn-pause" onclick="pauseService('${service.id}', 0)">Unpause</button>`
                    : `<button class="btn-small btn-pause" onclick="showPauseDialog('${service.id}')">Pause</button>`;
                const enableBtn = service.enabled
                    ? `<button class="btn-small btn-disable" onclick="toggleService('${service.id}', false)">Disable</button>`
                    : `<button class="btn-small btn-enable" onclick="toggleService('${service.id}', true)">Enable</button>`;
                const deleteBtn = `<button class="btn-small btn-delete" onclick="deleteService('${service.id}')">Delete</button>`;

                return `
                    <tr>
                        <td class="service-name-cell">${service.name}</td>
                        <td>${service.type.replace('_', ' ').toUpperCase()}</td>
                        <td style="word-break: break-all; max-width: 300px;">${target}</td>
                        <td><span class="status-badge ${statusClass}">${statusText}</span></td>
                        <td>${uptimeStr}</td>
                        <td>
                            <div class="btn-group">
                                ${editBtn}
                                ${pauseBtn}
                                ${enableBtn}
                                ${deleteBtn}
                            </div>
                        </td>
                    </tr>
                `;
            }).join('');
        }

