bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
                const result = await response.json();

                if (response.ok && result.success) {
                    let message = 'Test notifications sent!';
                    if (result.results && result.results.length > 0) {
                        const successChannels = result.results.filter(r => r.success).map(r => r.channel);
                        const failedChannels = result.results.filter(r => !r.success).map(r => r.channel);
                        
                        if (successChannels.length > 0) {
                            message = `Test sent successfully to: ${successChannels.join(', ')}`;
                        }
                        if (failedChannels.length > 0) {
                            message += ` (Failed: ${failedChannels.join(', ')})`;
                        }
                    }
                    showAlert(message, result.allSuccess ? 'success' : 'error');
                } else if (result.error) {
                    showAlert(result.error, 'error');
                } else {
                    showAlert('Failed to send test notifications', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        }

        // Export services
        function exportServices() {
            window.location.href = '/api/export';
        }

        // Import services
        async function importServices(file) {
            if (!file) return;

            try {
                const text = await file.text();
                const response = await fetch('/api/import', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: text
                });

                const result = await response.json();

                if (response.ok) {
                    showAlert(`Imported ${result.imported} service(s)` + 
                        (result.skipped > 0 ? `, skipped ${result.skipped}` : ''), 'success');
                    loadServices();
                } else {
                    showAlert('Import failed: ' + (result.error || 'Unknown error'), 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }

            // Reset file input
            document.getElementById('importFile').value = '';
        }

        // Auto-refresh services every 5 seconds
        setInterval(loadServices, 5000);

        // Initial load
        loadServices();
        document.getElementById('serviceType').dispatchEvent(new Event('change'));
    </script>
</body>
</html>
)rawliteral";
}
